<script setup>
import { APP_NAME, APP_URL, EMAIL_SUPPORT } from "@/helpers/config.js";
</script>

<template>
    <div class="flex items-center justify-center wrapper-922">
        <div class="flex flex-col relative mt-10">
            <div class="text-xl uppercase font-bold mb-6 sm:text-2xl md:text-3xl">Пользовательское соглашение</div>
            <div class="mb-4">Данное Пользовательское соглашение (далее — "Соглашение") регулирует отношения между пользователем (далее — "Пользователь") и компанией "{{ APP_NAME }}" (далее — "Компания") в отношении использования сайта {{ APP_URL }} (далее — "Сайт").</div>

            <div class="text-xl font-semibold mb-2">1. Цель Сайта</div>
            <div class="mb-4">Сайт предназначен для продажи товаров.</div>

            <div class="text-xl font-semibold mb-2">2. Услуги Сайта</div>
            <div class="mb-4">На Сайте доступны функции регистрации пользователей и возможность покупки товаров.</div>

            <div class="text-xl font-semibold mb-2">3. Условия оплаты</div>
            <div class="mb-4">Пользователь может приобрести подписку на выбранный им срок. Деньги не могут быть возвращены ни при каких условиях.</div>

            <div class="text-xl font-semibold mb-2">4. Обработка персональных данных</div>
            <div class="mb-4">Компания собирает и обрабатывает имя и email Пользователя для отправки уведомлений и улучшения услуг.</div>

            <div class="text-xl font-semibold mb-2">5. Ограничения</div>
            <div class="mb-4">Пользователю запрещено изменять или модифицировать исходный код Сайта. Также Пользователю запрещено копировать информацию с Сайта.</div>

            <div class="text-xl font-semibold mb-2">6. Права и обязанности Компании</div>
            <div class="mb-4">Компания имеет право изменять условия использования Сайта, публичную оферту, политику конфиденциальности и услуги без уведомления Пользователей. Компания вправе прекратить доступ к Сайту любому Пользователю без предоставления причин. Компания имеет право изменять услуги, цены и информацию о товарах без уведомления Пользователей.</div>

            <div class="text-xl font-semibold mb-2">7. Права Пользователей</div>
            <div class="mb-4">Пользователь имеет право запросить удаление своих данных, отправив соответствующий запрос на электронную почту {{ EMAIL_SUPPORT }}.</div>

            <div class="text-xl font-semibold mb-2">8. Информирование об изменениях</div>
            <div class="mb-4">Компания не обязуется информировать Пользователей о внесении изменений в данное Соглашение.</div>

            <div class="text-xl font-semibold mb-2">9. Дополнительные положения</div>
            <div class="mb-4">Данное Соглашение включает публичную оферту и политику конфиденциальности, которые также являются обязательными для Пользователей.</div>

            <div class="text-xl font-semibold mb-2">10. Заключительные положения</div>
            <div class="mb-4">Данное Соглашение вступает в силу с момента его опубликования на Сайте и действует до его замены или отмены.</div>
        </div>
    </div>
</template>

<script>
export default {
    mounted() {
        this.$emit("disableBackgroundElement");
    },
};
</script>
